Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=156_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Pohjoissaamenkieliset oppimateriaalit
smn: Tavesämikielâlâš oppâmateriaaleh

source: Pohjoissaame, äidinkieli
smn: Eenikielâ já čaabâkirjálâšvuotâ

source: Pohjoissaame, kirjallisuus
smn: Davvisámegiella vieris giellan

source: Pohjoissaame vieraana kielenä
smn: Badjeskuvlla matematihkka

source: Pohjoissaame, yläkoulun matematiikka
smn: Vuolleskuvlla matematihkka

source: Pohjoissaame, alakoulun matematiikka
smn: Fysihkka ja kemiija

source: Pohjoissaame, fysiikka ja kemia
smn: Deavvašvuođadiehtu Biologiija

source: Pohjoissaame, terveystieto
smn: Biras- ja luonddudiehtu

source: Pohjoissaame, biologia
smn: Eatnandiehtu

source: Pohjoissaame, ympäristö- ja luonnontieto
smn: Oskkoldat ja eallinoaidnu Historjá

source: Pohjoissaame, maantieto
smn: Duodji Eará materiálat
